class Doc {
  static const organizationText =
      ' Северо-Кавказский филиал ордена Трудового Красного Знамени федерального государственного '
      'бюджетного образовательного учреждения высшего образования «Московский технический университет связи и информатики» (СКФ МТУСИ).';

  static const requisites =
      '**Адрес:** 344002, г.Ростов-на-Дону, ул.Серафимовича, 62.\n\n'
      '**Телефон:** (863) 310-69-60\n\n'
      '**Факс:** (863) 310-69-68\n\n'
      '**Телекс:** 123432 VOLT RU\n\n'
      '**E-mail:** [mаil@skf-mtusi.ru](http://mаil@skf-mtusi.ru)\n\n'
      '**Соц.сеть:** [Официальный аккаунт СКФ МТУСИ в Instagram](https://www.instagram.com/skf_mtuci/?igshid=15jvm4yow7y7d)';

  static const schedule = '**Общий режим работы филиала**\n\n'
      'С понедельника по пятницу: с 8.00 до 22.00\n\n'
      'Перерыв с 13.00 до 14.00\n\n'
      'Суббота: с 08.00 до 14.00\n\n'
      '**Единые часы работы с посетителями**\n\n'
      'С понедельника по четверг: с 09.00 до 11.00 и с 16.00 до 18.00\n\n'
      'В пятницу с 14.00 до 16.00\n\n'
      'Суббота: с 10.00 до 12.00';
}
